In [135]:
import pandas as pd
import numpy as np

In [197]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [198]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [199]:
# 1. Some values in the the FlightNumber column are missing. 
# These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be 
# put in place. Fill in these missing numbers and make the column an 
# integer column (instead of a float column).

tp = df["FlightNumber"].copy()

In [200]:
tp[1] = 10055
tp[3] = 10075

df["FlightNumber"] = tp.astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [201]:
# 2. The From_To column would be better as two separate columns! 
# Split each string on the underscore delimiter _ to give a new temporary DataFrame  
# with the correct values. Assign the correct column names to this temporary DataFrame.

In [273]:
temp = df["From_To"].str.split("_", expand=True)
temp

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [274]:
temp.rename(columns = {0:"From",1:"To"}, inplace = True)

In [275]:
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [276]:
# 3. Notice how the capitalisation of the city names is all mixed up in this 
# temporary DataFrame. Standardise the strings so that only the first letter is 
# uppercase (e.g. "londON" should become "London".)

In [277]:
temp["From"].str.capitalize

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [264]:
temp